### 5. Create a BQ dataset for each of your datasets

In [1]:
airbnb_dataset_id="airbnb_staging"

In [2]:
!bq --location=US mk --dataset {airbnb_dataset_id}

BigQuery error in mk operation: Dataset 'total-earth-236521:airbnb_staging'
already exists.

In [3]:
zillow_dataset_id="zillow_staging"

In [4]:
!bq --location=US mk --dataset {zillow_dataset_id}

BigQuery error in mk operation: Dataset 'total-earth-236521:zillow_staging'
already exists.

### 6. Import the CSV files for each dataset into their respective BQ dataset

### AirBnB Dataset

In [4]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {airbnb_dataset_id}.Austin_calendar 'gs://finalpush/airbnb/Austin_calendar.csv'

Waiting on bqjob_r69f6672aa5edc2df_00000178c7c040a5_1 ... (64s) Current status: DONE

In [11]:
!bq --location=US load --autodetect --skip_leading_rows=1 --allow_quoted_newlines=true \
--source_format=CSV {airbnb_dataset_id}.Austin_listings 'gs://finalpush/airbnb/Austin_listings.csv'

Waiting on bqjob_r769674cbd317d94a_00000178ce6ee1a4_1 ... (47s) Current status: DONE

In [7]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {airbnb_dataset_id}.Austin_neighbourhoods 'gs://finalpush/airbnb/Austin_neighbourhoods.csv'

Waiting on bqjob_r599f34cdaf623e4f_00000178c7c51972_1 ... (1s) Current status: DONE

In [8]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {airbnb_dataset_id}.Austin_reviews 'gs://finalpush/airbnb/Austin_reviews.csv'

Waiting on bqjob_r9a826e060052195_00000178c7c5ac9f_1 ... (2s) Current status: DONE

In [10]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {airbnb_dataset_id}.Boston_calendar 'gs://finalpush/airbnb/Boston_calendar.csv'

Waiting on bqjob_r19c8e9bf3e5590b2_00000178c7c69b35_1 ... (22s) Current status: DONE

In [19]:
!bq --location=US load --autodetect --skip_leading_rows=1 --allow_quoted_newlines=true \
--source_format=CSV {airbnb_dataset_id}.Boston_listings 'gs://finalpush/airbnb/Boston_listings.csv'

Waiting on bqjob_r57bec9ffd9a422ed_00000178ce73bab2_1 ... (1s) Current status: DONE

In [14]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {airbnb_dataset_id}.Boston_neighbourhoods 'gs://finalpush/airbnb/Boston_neighbourhoods.csv'

Waiting on bqjob_r5a809c89dca29b90_00000178c7c92d72_1 ... (1s) Current status: DONE

In [15]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {airbnb_dataset_id}.Boston_reviews 'gs://finalpush/airbnb/Boston_reviews.csv'

Waiting on bqjob_r2d3612e42db96ece_00000178c7c95688_1 ... (1s) Current status: DONE

In [16]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {airbnb_dataset_id}.LA_calendar 'gs://finalpush/airbnb/LA_calendar.csv'

Waiting on bqjob_r63928c0fb50c27bc_00000178c7c99e46_1 ... (134s) Current status: DONE

In [17]:
!bq --location=US load --autodetect --skip_leading_rows=1 --allow_quoted_newlines=true \
--source_format=CSV {airbnb_dataset_id}.LA_listings 'gs://finalpush/airbnb/LA_listings.csv'

Waiting on bqjob_r7d124f457b8be868_00000178ce736783_1 ... (3s) Current status: DONE

In [18]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {airbnb_dataset_id}.LA_neighbourhoods 'gs://finalpush/airbnb/LA_neighbourhoods.csv'

Waiting on bqjob_r1d75eea61d27724b_00000178c7cbc007_1 ... (1s) Current status: DONE

In [19]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {airbnb_dataset_id}.LA_reviews 'gs://finalpush/airbnb/LA_reviews.csv'

Waiting on bqjob_r4f6a88792de5cce1_00000178c7cbcc96_1 ... (3s) Current status: DONE

In [27]:
#%%bigquery
#drop table zillow_staging.long_term_rentals_transposed

Empty DataFrame
Columns: []
Index: []

### Zillow Dataset - consulted with TA, suggested to use 2 more tables (homevalue & inventory) aside from Long-term rent

In [5]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {zillow_dataset_id}.zillow_rental 'gs://finalpush/zillow/zillow_rental.csv'

Waiting on bqjob_rdcacfca89e9557b_00000178d3ab2a37_1 ... (1s) Current status: DONE

In [9]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {zillow_dataset_id}.zillow_homevalue 'gs://finalpush/zillow/zillow_homevalue.csv'

Waiting on bqjob_r4b62693e0a27d7e7_00000178d3b27391_1 ... (2s) Current status: DONE

In [8]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {zillow_dataset_id}.zillow_inventory 'gs://finalpush/zillow/zillow_inventory.csv'

Waiting on bqjob_r7ab77a4e936aee94_00000178d3ac306d_1 ... (1s) Current status: DONE

### 7. Write some SQL queries to explore your BQ datasets

Return  the count of room type for each neighborhood in Austin, counting only those with
renting price is more that 20 USD

In [2]:
%%bigquery
SELECT count(al.room_type) as counting, al.room_type, al.neighbourhood
FROM airbnb_staging.Austin_listings as al 
WHERE al.price >= 20
GROUP BY al.neighbourhood, al.room_type 
ORDER BY al.neighbourhood 
LIMIT 5

   counting        room_type  neighbourhood
0         4      Shared room          78701
1       644  Entire home/apt          78701
2        59     Private room          78701
3         6       Hotel room          78701
4      1065  Entire home/apt          78702

Return the total numbers of reviews for each neighborhood in Austin
specifically for Hotel room type

In [39]:
%%bigquery
SELECT sum(al.number_of_reviews) as totalReviews, al.neighbourhood
FROM airbnb_staging.Austin_listings as al
WHERE al.room_type = 'Hotel room'
GROUP BY al.neighbourhood
ORDER BY totalReviews
LIMIT 5

   totalReviews  neighbourhood
0             0          78746
1             0          78704
2             1          78734
3             1          78733
4           150          78701

Return total of unoccupied property for each neighborhood in Austin
(this should be useful when compared to price and popularity)

In [40]:
%%bigquery
SELECT count(*) as totalUnoccupied, al.neighbourhood
FROM airbnb_staging.Austin_listings as al
JOIN airbnb_staging.Austin_calendar as cd
ON al.id = cd.listing_id
WHERE cd.available = TRUE 
GROUP BY al.neighbourhood
ORDER BY totalUnoccupied DESC
LIMIT 5

   totalUnoccupied  neighbourhood
0           226181          78704
1           151482          78702
2            93322          78701
3            76685          78751
4            68803          78745

Return the average price of the property for each month of the year in Austin
specifically averaging across those propertywith medium stay (more than 14 nights)

In [41]:
%%bigquery
SELECT avg(cd.price) as avgPrice, extract (month from cd.date) as month
FROM airbnb_staging.Austin_calendar as cd
WHERE cd.minimum_nights>= 14
GROUP BY month
ORDER BY avgPrice DESC
LIMIT 12

      avgPrice  month
0   149.006551     10
1   146.643563      7
2   146.622644      9
3   145.233153     11
4   144.585445      1
5   144.510880      8
6   144.428015      6
7   144.396964     12
8   143.852969      5
9   143.727773      3
10  143.678553      4
11  142.225791      2

Return the range and average of the short-term rental price (min and max) for each neighborhood in Austin
specifically want to see only where the minPrice is greater than 10 USD (below 10 USD/day seems unreasonable for rent)

In [42]:
%%bigquery
SELECT min(al.price) as minPrice, max(al.price) as maxPrice, avg(al.price) as avgPrice, al.neighbourhood
FROM airbnb_staging.Austin_listings as al
GROUP BY al.neighbourhood
HAVING minPrice >=10
ORDER BY maxPrice DESC
LIMIT 10

   minPrice  maxPrice     avgPrice  neighbourhood
0        28     16264  1051.074627          78733
1        10     10000   242.773163          78723
2        10     10000   413.058491          78703
3        20     10000   290.610098          78701
4        19      9998   392.829268          78750
5        40      6948  1061.837838          78730
6        23      5035   780.702128          78732
7        19      5021   210.954545          78749
8        39      5000   358.158590          78734
9        48      4575   474.237113          78737

In [43]:
# Zillow

Return the average long-term house value in Austin and its inventory for each year in Austin
we want to see only year before 2021 (to have full coverage)

In [44]:
%%bigquery
SELECT avg(hv.Austin) as AVGHomeValue, avg(inv.Austin) as AVGInventory, extract (year from inv.Date) as Year
FROM zillow_staging.zillow_homevalue as hv
JOIN zillow_staging.zillow_inventory as inv
ON  extract (year from hv.Date) = extract (year from inv.Date)
GROUP BY Year
HAVING Year < 2021
ORDER BY AVGHomeValue

    AVGHomeValue  AVGInventory  Year
0  334535.083333   9974.916667  2018
1  349291.000000  10537.166667  2019
2  371923.083333   9309.333333  2020

Return an average of long-ter, rental price and inventory for ALL 3 Cities we pick for each year,
specifically we retrieve only the year before 2021 to have the full coverage

In [45]:
%%bigquery
SELECT avg(rt.USA) as US, avg(rt.Austin) as ATX, avg(rt.Boston) as BOS, avg(rt.LA) as LA, 
avg(inv.Austin) as invAus, avg(inv.Boston) as invBos, avg(inv.LA) as invLA, 
extract (year from rt.Date) as Year
FROM zillow_staging.zillow_rental as rt
JOIN zillow_staging.zillow_inventory as inv
ON  extract (year from rt.Date) = extract (year from inv.Date)
GROUP BY Year
HAVING Year < 2021
LIMIT 5

,US,ATX,BOS,LA,invAus,invBos,invLA,Year
0,1655.500000,1446.666667,2338.083333,2433.416667,9974.916667,14230.916667,26620.083333,2018
1,1715.083333,1511.250000,2411.583333,2523.000000,10537.166667,15454.583333,29247.583333,2019
2,1744.416667,1523.083333,2378.333333,2548.583333,9309.333333,12656.416667,23693.833333,2020

Return the average home value in austin and long-term rental price for each month in Austin
for the year 2020

In [46]:
%%bigquery
SELECT avg(hv.Austin) avgHome, avg(rt.Austin) as avgRent, extract(month from rt.Date) as month
FROM zillow_staging.zillow_rental as rt
JOIN zillow_staging.zillow_homevalue as hv
ON  extract (month from rt.Date) = extract (month from hv.Date)
WHERE extract (year from rt.Date) = 2020
GROUP BY month
ORDER BY avgRent DESC 
LIMIT 10

         avgHome  avgRent  month
0  239718.461538   1531.0      1
1  240585.307692   1530.0      2
2  234603.160000   1528.0      3
3  235294.080000   1527.0      4
4  235987.480000   1525.0      5
5  236695.280000   1524.0      6
6  237409.920000   1522.0      7
7  238156.440000   1521.0      8
8  238910.960000   1519.0      9
9  239721.880000   1518.0     10

Return the average of long-term housing value (from Zillow) and average short-term rental prince (from Airbnb)
for each year in Austin. Specifically, we want only those with a VERY SHORT-TERM rent housing (min_nights <= 10)

In [3]:
%%bigquery
SELECT avg(hv.Austin) avgHomeValue, avg(ac.price) as price, extract (year from ac.Date) as Year
FROM zillow_staging.zillow_homevalue as hv
JOIN airbnb_staging.Austin_calendar as ac
ON  extract (year from ac.Date) = extract (year from ac.Date)
WHERE ac.minimum_nights <= 10
GROUP BY Year
ORDER BY price
LIMIT 10

   avgHomeValue       price  Year
0  238267.36755  347.160344  2021
1  238267.36755  449.083443  2022

Return the average long-term rental price and the average short-term price for each month
by doing cross-dataset join (zillow = long-term & airbnb = short-term).
We want to see only the data in summer i.e. month 6,7,8 - Summer is expected not to be
popular for short-term renting

In [48]:
%%bigquery
SELECT avg(rt.Austin) LT_rent, avg(ac.price) as AirBnBprice, extract (month from ac.Date) as Month
FROM zillow_staging.zillow_rental as rt
JOIN airbnb_staging.Austin_calendar as ac
ON  extract (month from rt.Date) = extract (month from ac.Date)
GROUP BY Month
HAVING  Month in (6,7,8)
ORDER BY LT_rent

       LT_rent  AirBnBprice  Month
0  1408.000000   296.503778      6
1  1412.000000   312.395859      7
2  1415.857143   322.386732      8